{"backend": "tensorflow", "keras_version": "2.0.3", "config": [{"config": {"bias_constraint": null, "unroll": false, "dropout": 0.0, "batch_input_shape": [1, 1, 1], "dtype": "float32", "bias_regularizer": null, "go_backwards": false, "stateful": true, "recurrent_dropout": 0.0, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "trainable": true, "units": 1, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "activation": "tanh", "name": "lstm_1", "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 5, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "name": "dense_1"}, "class_name": "Dense"}], "class_name": "Sequential"}